 gcc -g p1original.c
 gcc -g p2original.c
 ./a.out
enter the value
1
2
3
large value 3 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x835: file p2original.c, line 27.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2original.c:27
27  {
(gdb) n
29  input(&a,&b,&c);
(gdb) n
enter the value
n
30  cmp(a,b,c,&large);
(gdb) n
31  output(a,b,c,large);
(gdb) n
32  return 0;
(gdb) l
27  {
28  int a,b,c,large;
29  input(&a,&b,&c);
30  cmp(a,b,c,&large);
31  output(a,b,c,large);
32  return 0;
33  }(gdb) s
33  }(gdb) p
The history is empty.
(gdb) c
Continuing.
large value 1145639824[Inferior 1 (process 495) exited normally]
(gdb) l
28  int a,b,c,large;
29  input(&a,&b,&c);
30  cmp(a,b,c,&large);
31  output(a,b,c,large);
32  return 0;
