 gcc -g p1original.c
 gcc -g p3original.c
 ./a.out
Enter a number
5
Enter the element no 0 of the array
1
Enter the element no 1 of the array
2
Enter the element no 2 of the array
3
Enter the element no 3 of the array
4
Enter the element no 4 of the array
5
The sum of1 + 2 + 3 + 4 + 5 = 15
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x90c: file p3original.c, line 37.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3original.c:37
37  {
(gdb) n
39    n=input();
(gdb) n
Enter a number
n
40    int a[n];
(gdb) n
41    input_array(n,a);
(gdb) n
42    sum=array_sum(n,a);
(gdb) n
43    output(n,a,sum);
(gdb) l
38    int n,sum;
39    n=input();
40    int a[n];
41    input_array(n,a);
42    sum=array_sum(n,a);
43    output(n,a,sum);
44  }(gdb) s
output (n=0, a=0x7fffb04f9b30, sum=0) at p3original.c:29
29    printf("The sum of");
(gdb) p
The history is empty.
(gdb) c
Continuing.
The sum of-1336960112 = 0
[Inferior 1 (process 607) exited normally]
(gdb) l
24    return sum;
25  }
26  int output(int n, int a[n], int sum)
27  {
28    int i;
29    printf("The sum of");
30    for(i=0;i<n-1;i++)
31    {
32      printf("%d + ",a[i]);
33    }
